In [142]:
import pandas as pd
scientists = pd.read_csv('../data/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [143]:
ages = scientists['Age']
ages.max()

90

In [144]:
ages.mean()

59.125

In [145]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

* describe 를 통해 전체 통계를 내줄 수 있다.

In [146]:
print(ages[ages > ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

* 특정 조합에서 조건을 넣기 위해선 집합[조건] 식으로 가능하다

In [147]:
print(ages > ages.mean())
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

* print 문으로 조건 만 넣으면, 인덱스중 조건에 대한불린값을 반환해준다

In [148]:
manual_bool_values = [True, True, False, False, True, True, False, True]

In [149]:
print(ages[manual_bool_values])

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

## 벡터와 스칼라로 브로드 캐스팅 수행하기

* 벡터: 시리즈처럼 여러 개의 값을 가진 데이터 
* 스칼라: 단순 크기를 나타내는 데이터

* ages 와 같이 같은 시리즈 끼리는( 숫자타입에 한해 ) 사칙연산이 가능하다.
* 위의 ages 같은 데이터를 벡터

In [150]:
print(ages+ages)
print(ages*ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

* 특정 시리즈에 정해진 수치를 전체에 기입하는것.-> 브로드캐스팅(스칼라)

In [151]:
print(ages+100)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64



* 길이가 다른 벡터 연산

In [152]:
print(pd.Series([1,100]))

0      1
1    100
dtype: int64

* NaN은 값이 없다라는것을 의미한다. ( Null )

In [153]:
print(ages +pd.Series([1,100]))

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

### .sort_values(by=[columns], ascending = 옵션)

* 인덱스 순서를 역으로 출력할때, .sort_index(ascending = False) 옵션 사용

In [154]:
rev_ages = ages.sort_index(ascending=False)
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

* 인덱스의 values 에 대한 sort가 필요할 떈 .sort_values 옵션을 사용해준다.

In [155]:
ages_sr = ages.sort_values(ascending = False)
print(ages_sr)

2    90
7    77
3    66
1    61
4    56
5    45
6    41
0    37
Name: Age, dtype: int64

In [156]:
print(ages+rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

## 데이터  프레임: 불린 추출과 브로드캐스팅

In [157]:
print(scientists[scientists['Age'] > scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [158]:
scientists.loc[[True,True,False,True]]

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [159]:
scientists *2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

## 시리즈와 데이터프레임의 데이터 처리하기

* 파이썬의 문자열은 판단스의 오브젝트로 취급됨

In [160]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

* 날짜 형식으로 바꿔주기(dtype = datetime )

In [161]:
born_datetime = pd.to_datetime(scientists['Born'], format = '%Y-%m-%d')

In [162]:
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [163]:
died_datetime = pd.to_datetime(scientists['Died'], format = '%Y-%m-%d')



* scientists 에 컬럼 추가하기

In [164]:
scientists['born_dt'], scientists['died_dt'] =(born_datetime, died_datetime)

In [165]:
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [166]:
scientists['age_days_dt'] = (scientists['died_dt']- scientists['born_dt'])

In [167]:
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days

### 문제 풀어보기

In [168]:
secc = pd.read_csv('../data/01. CCTV_in_seoul.csv', sep=',')

In [169]:
secc.sort_values(by=['소계']).head(5)

    기관명   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

In [170]:
secc.sort_values(by=['소계'], ascending= False).head(5)

    기관명    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

In [171]:
secc['CCTV증가율'] = (secc['2016년'] +secc['2015년'])/ secc['2014년']*100

In [172]:
secc.head(5)

   기관명    소계  2013년도 이전  2014년  2015년  2016년     CCTV증가율
0  강남구  2780       1292    430    584    932  352.558140
1  강동구   773        379     99    155    377  537.373737
2  강북구   748        369    120    138    204  285.000000
3  강서구   884        388    258    184     81  102.713178
4  관악구  1496        846    260    390    613  385.769231

In [173]:
secc.sort_values(by=['CCTV증가율'], ascending=False).head(1)

     기관명    소계  2013년도 이전  2014년  2015년  2016년     CCTV증가율
10  동대문구  1294       1070     23    198    579  3378.26087

## 시리즈, 데이터프레임섞기
### 데이터 프레임의 열 삭제하기

In [174]:
scientists_dropped = scientists.drop(['Age'], axis = 1)

* drop옵션중 axis =1은 행과열이 (0,1)임으로, 1이란 뜻은 열을 삭제하겠다는 뜻

In [175]:
scientists_dropped

,Name,Born,Died,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

## 데이터 피클, csv,tsv 파일로 저장하고 불러오기

### 1. 피클로 저장하기

In [176]:
names = scientists['Name']

In [177]:
names.to_pickle('../data/scientists_names_series.pickle')

In [178]:
scientists.to_pickle('../data/scientists_df.pickle')

* 저장된 피클을 열때

In [179]:
scientists_pic = pd.read_pickle('../data/scientists_df.pickle')
scientists_pic_name = pd.read_pickle('../data/scientists_names_series.pickle')

In [180]:
scientists_pic
scientists_pic_name

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

### 2. csv, tsv파일로 저장하기

In [182]:
names.to_csv('../data/scientists_names_series.csv')

In [183]:
scientists.to_csv('../data/scientists_df.csv', sep='\t')

In [184]:
scientists.to_csv('../data/scientists_df_noindex.csv', index=False)

### 3. xls 파일로 저장하기

In [185]:
names_df = names.to_frame()

In [186]:
import xlwt
names_df.to_excel('../data/scientists_names_series_df.xls')

In [187]:
import openpyxl
names_df.to_excel('../data/scientists_names_series_df.xlsx')
scientists.to_excel('../data/scientists_df.xlsx')